[
    {
        "charity_name": "Race Forward",
        "charity_link": "https://www.raceforward.org/",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=15976&fromlistid=266",
        "charity_description": "Race Forward's mission is to build awareness, solutions, and leadership for racial justice by generating transformative ideas, information, and experiences. We define racial justice as the systematic fair treatment of people of all races, resulting in equitable opportunities and outcomes for all and we work to advance racial justice through media, research, and leadership development. Race Forward envisions a vibrant world in which people of all races create, share and enjoy resources and relationships equitably, unleashing individual potential, embracing collective responsibility and generating global prosperity. We strive to be a leading values-driven social justice enterprise where the culture and commitment created by our multi-racial and diverse staff supports individual and organizational excellence and sustainability.",
        "charity_short_description": "The Center for Racial Justice Innovation",
        "rating": "80.55",
        "clean_charity_link": "raceforward.org"
    },
    {
        "charity_name": "NAACP Legal Defense and Educational Fund",
        "charity_link": "http://www.naacpldf.org",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=4146&fromlistid=266",
        "charity_description": "The NAACP Legal Defense and Educational Fund (LDF) was founded in 1940 under the leadership of Thurgood Marshall. Although LDF's primary purpose was to provide legal assistance to poor African Americans, its work over the years has brought greater justice to all Americans. Originally affiliated with the National Association for the Advancement of Colored People (NAACP), LDF has been an entirely separate organization since 1957. LDF has been involved in more cases before the U.S. Supreme Court than any organization except the U.S. Department of Justice. Although LDF works primarily through the courts, its strategies include advocacy, educational outreach, legislation monitoring, coalition building and policy research. Additionally, it provides scholarships for exceptional African-American students.",
        "charity_short_description": "Defend, educate, empower",
        "rating": "89.16",
        "clean_charity_link": "naacpldf.org"
    },
    {
        "charity_name": "Public Advocates",
        "charity_link": "http://www.publicadvocates.org/",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=16400&fromlistid=266",
        "charity_description": "Public Advocates is a nonprofit law firm and advocacy organization that challenges the systemic causes of poverty and racial discrimination by strengthening community voices in public policy and achieving tangible legal victories advancing education, housing transportation equity and climate justice. We spur change through collaboration with grassroots groups representing low-income communities, people of color and immigrants, combined with strategic policy reform, media advocacy and litigation, “making rights real” across California since 1971.",
        "charity_short_description": "Making rights real",
        "rating": "89.54",
        "clean_charity_link": "publicadvocates.org"
    },
    {
        "charity_name": "Equal Justice Initiative",
        "charity_link": "http://www.eji.org",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=12756&fromlistid=266",
        "charity_description": "EJI is committed to ending mass incarceration and excessive punishment in the United States, to challenging racial and economic injustice, and to protecting basic human rights for the most vulnerable people in American society. Founded in 1989 by Bryan Stevenson, a widely acclaimed public interest lawyer and bestselling author of Just Mercy, EJI provides legal representation to people who have been illegally convicted, unfairly sentenced, or abused in state jails and prisons. We challenge the death penalty and excessive punishment and we provide re-entry assistance to formerly incarcerated people. EJI works with communities that have been marginalized by poverty and discouraged by unequal treatment. We are committed to changing the narrative about race in America. In 2018, EJI plans to build a national memorial to victims of lynching and open a museum that explores African American history from enslavement to mass incarceration.",
        "charity_short_description": "Committed to ending mass incarceration and excessive punishment in the United States",
        "rating": "100.00",
        "clean_charity_link": "eji.org"
    },
    {
        "charity_name": "Advancement Project",
        "charity_link": "http://www.advancementproject.org/",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=16010&fromlistid=266",
        "charity_description": "Advancement Project is a next generation, multi-racial civil rights organization. Rooted in the great human rights struggles for equality and justice, we exist to fulfill America's promise of a caring, inclusive and just democracy. We use innovative tools and strategies to strengthen social movements and achieve high impact policy change. From Advancement Project's inception, we have worked \"on-the-ground,\" helping organized communities of color dismantle and reform the unjust and inequitable policies that undermine the promise of democracy. Simultaneously, we have aggressively sought and seized opportunities to promote this approach to racial justice",
        "charity_short_description": "…just democracy!",
        "rating": "86.74",
        "clean_charity_link": "advancementproject.org"
    },
    {
        "charity_name": "National Association for the Advancement of Colored People",
        "charity_link": "http://www.naacp.org",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=4158&fromlistid=266",
        "charity_description": "Since its inception in 1909, the National Association for the Advancement of Colored People (NAACP) has strived to ensure the political, educational, social and economic equality of rights of all persons and to eliminate racial hatred and racial discrimination. The objectives of the NAACP are to achieve equality of rights and eliminate race prejudice among the citizens of the United States; remove all barriers of racial discrimination through democratic processes; seek enactment and enforcement of federal, state and local laws securing civil rights; inform the public of the adverse effects of racial discrimination and to seek its elimination; and to educate persons as to their constitutional rights and to take all lawful action to secure the exercise of these rights.",
        "charity_short_description": "Making democracy real in the United States since 1909",
        "rating": "80.51",
        "clean_charity_link": "naacp.org"
    },
    {
        "charity_name": "Institute for Free Speech",
        "charity_link": "http://www.ifs.org",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=13397&fromlistid=266",
        "charity_description": "Through strategic litigation, communication, activism, training, research, and education, the Institute for Free Speech (IFS) works to promote and defend the political rights to free speech, press, assembly, and petition guaranteed by the First Amendment.We are the nation's leading organization dedicated solely to protecting First Amendment political rights. The Institute for Free Speech represents clients on a pro bono basis in order to secure their First Amendment rights. IFS actively pursues strategic litigation and files amicus briefs to those ends.",
        "charity_short_description": "Protecting speech, press, assembly, and petition rights",
        "rating": "97.23",
        "clean_charity_link": "ifs.org"
    },
    {
        "charity_name": "Southern Poverty Law Center",
        "charity_link": "http://www.splcenter.org",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=4482&fromlistid=266",
        "charity_description": "The Southern Poverty Law Center (SPLC) was founded in 1971 as a small civil rights law firm. Today, SPLC is internationally known for its tolerance education programs, its legal victories against white supremacists and its tracking of hate groups. Throughout its history, SPLC has worked to make the nation's Constitutional ideals a reality. The SPLC legal department fights all forms of discrimination and works to protect society's most vulnerable members, handling innovative cases that few lawyers are willing to take. The SPLC Intelligence Project monitors hate groups and tracks extremist activity throughout the U.S. To combat the causes of hate, SPLC in 1991 established Teaching Tolerance, an educational program to help K-12 teachers foster respect and understanding in the classroom.",
        "charity_short_description": "Fighting Hate, Teaching Tolerance, Seeking Justice",
        "rating": "90.96",
        "clean_charity_link": "splcenter.org"
    },
    {
        "charity_name": "Headwaters Foundation for Social Justice",
        "charity_link": "http://www.headwatersfoundation.org",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=11536&fromlistid=266",
        "charity_description": "Headwaters Foundation for Justice is a catalyst for social, racial, economic and environmental justice. All Minnesotans deserve the chance to both contribute to and benefit from the state's environmental, economic, social and civic resources. We believe community organizing is the best way to make this vision a reality. Through grantmaking and organizational assistance, Headwaters supports grassroots groups addressing the root causes of injustice. Headwaters engages and partners with a committed community of donors and allies who work for justice.",
        "charity_short_description": "Addressing the root causes of injustice.",
        "rating": "88.80",
        "clean_charity_link": "headwatersfoundation.org"
    },
    {
        "charity_name": "Leadership Conference Education Fund",
        "charity_link": "http://leadershipconferenceedfund.org/",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=9421&fromlistid=266",
        "charity_description": "The Leadership Conference on Civil and Human Rights is a coalition charged by its diverse membership of more than 200 national organizations to promote and protect the civil and human rights of all persons in the United States. Through advocacy and outreach to targeted constituencies, The Leadership Conference works toward the goal of a more open and just society - an America as good as its ideals.The Leadership Conference Education Fund builds public will for federal policies that promote and protect the civil and human rights of all persons in the United States. The Education Fund's campaigns empower and mobilize advocates around the country to push for progressive change in the United States.",
        "charity_short_description": "The education and outreach arm of the nation's premier civil & human rights coalition",
        "rating": "92.21",
        "clean_charity_link": "leadershipconferenceedfund.org"
    },
    {
        "charity_name": "People's Action Institute",
        "charity_link": "https://peoplesaction.org/",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=15276&fromlistid=266",
        "charity_description": "Founded in 1972, National People's Action (NPA) is a network of grassroots organizations with a fierce reputation for direct action from across the country that work to advance a national economic and racial justice agenda. NPA has over 200 organizers working to unite everyday people in cities, towns, and rural communities throughout the United States through direct-action, house meetings and community organizing. NPA staffs and supports three local, state and national campaigns in support of economic and racial justice: bank accountability, housing justice, and immigrant and worker's rights.",
        "charity_short_description": "Working to advance a national economic and racial justice agenda.",
        "rating": "89.57",
        "clean_charity_link": "peoplesaction.org"
    },
    {
        "charity_name": "Center for Constitutional Rights",
        "charity_link": "https://ccrjustice.org/",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=7728&fromlistid=266",
        "charity_description": "The Center for Constitutional Rights (CCR) is dedicated to advancing and protecting the rights guaranteed by the United States Constitution and the Universal Declaration of Human Rights. Founded in 1966 by attorneys who represented civil rights movements in the South, CCR is a legal and educational organization committed to the creative use of law as a positive force for social change. CCR uses litigation proactively to advance the law in a positive direction, to empower poor communities and communities of color, to guarantee the rights of those with the fewest protections and least access to legal resources, to train the next generation of constitutional and human rights attorneys, and to strengthen the broader movement for constitutional and human rights.",
        "charity_short_description": "Dedicated to advancing and protecting the rights guaranteed by the United States Constitution",
        "rating": "91.62",
        "clean_charity_link": "ccrjustice.org"
    },
    {
        "charity_name": "Lawyers' Committee for Civil Rights Under Law",
        "charity_link": "http://www.lawyerscommittee.org/",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=7079&fromlistid=266",
        "charity_description": "The Lawyers' Committee for Civil Rights Under Law is the nation's leading civil rights organization that works in partnership with the private bar to fight for a stronger and more inclusive democracy. The Lawyers' Committee is a nonpartisan organization, formed in 1963 at the request of President John F. Kennedy to involve the private bar in providing legal services to address racial discrimination. The principal mission of the Lawyers' Committee is to secure, through the rule of law, equal justice under law. The Committee's major objective is to use the skills and resources of the bar to obtain equal opportunity for minorities by addressing factors that contribute to racial justice and economic opportunity. The Lawyers' Committee implements its mission and objectives by marshaling the pro bono resources of the bar for litigation, legal advocacy, public policy advocacy, and other forms of service by lawyers to the cause of civil rights.",
        "charity_short_description": "Securing, through the rule of law, equal justice under law",
        "rating": "97.39",
        "clean_charity_link": "lawyerscommittee.org"
    },
    {
        "charity_name": "CLASP",
        "charity_link": "http://www.clasp.org/",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=9420&fromlistid=266",
        "charity_description": "Since 1968, CLASP (Center for Law and Social Policy) has been a trusted resource, a creative architect for systems change, and one of the country's most effective voices for low income people. CLASP's mission is to develop and advocate for policies at the federal, state and local levels that improve the lives of low income people. In particular, we seek policies that work to strengthen families and create pathways to education and work. Through careful research and analysis and effective advocacy, CLASP develops and promotes new ideas, mobilizes others, and directly assists governments and advocates to put in place successful strategies that deliver results that matter to people across America. We are nonpartisan and situated at the intersection of local practice, national research, and state and federal policy, and striving to translate each world to each other.",
        "charity_short_description": "Policy solutions that work for low-income people",
        "rating": "96.66",
        "clean_charity_link": "clasp.org"
    },
    {
        "charity_name": "American Civil Liberties Union Foundation",
        "charity_link": "http://www.aclu.org",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=3247&fromlistid=266",
        "charity_description": "The American Civil Liberties Union (ACLU) Foundation is the arm of the ACLU that conducts litigation and communication efforts. The Foundation provides legal presentation in cases involving issues of civil liberties and constitutional rights ranging from administrative hearings to trials and appeals. In addition, the Foundation educates the public as to civil liberties and constitutional rights by disseminating literature and other publications. The ACLU Foundation preserves and promotes civil rights and liberties as guaranteed by the United States Constitution.",
        "charity_short_description": "We the People",
        "rating": "92.02",
        "clean_charity_link": "aclu.org"
    },
    {
        "charity_name": "PolicyLink",
        "charity_link": "http://www.policylink.org/",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=9792&fromlistid=266",
        "charity_description": "PolicyLink is a national research and action institute advancing economic and social equity. PolicyLink work is guided by the belief that those closest to the nation's challenges are central to the search for solutions. With local and national partners, PolicyLink is spotlighting promising practices, supporting advocacy campaigns, and helping to bridge the traditional divide between local communities and policymaking at the local, regional, state, and national levels. By developing and implementing multifaceted strategies, PolicyLink seeks to ensure that everyone- including low-income communities of color- can contribute to and benefit from local and regional growth and development.",
        "charity_short_description": "Lifting up what works",
        "rating": "91.44",
        "clean_charity_link": "policylink.org"
    },
    {
        "charity_name": "National Black Child Development Institute",
        "charity_link": "http://nbcdi.org/",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=9550&fromlistid=266",
        "charity_description": "For the past 40 years, the National Black Child Development Institute has been steadfast in its mission to improve and advance the lives of Black children and their families, through advocacy and education. Along with our affiliate network - composed of volunteers from across the nation - we have worked to improve child welfare services, make universal early care and education a reality, build family support services, press for educational reform and provide vital information regarding our children's health. Preparing our children to function in a global society where having access to the latest technology is considered the norm makes education extremely critical to our future work. Every child deserves a chance, and we are committed to uncovering every chance available to our children.",
        "charity_short_description": "Improving and advancing the lives of black children and their families",
        "rating": "82.32",
        "clean_charity_link": "nbcdi.org"
    },
    {
        "charity_name": "Amnesty International USA",
        "charity_link": "https://www.amnestyusa.org/",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=3294&fromlistid=266",
        "charity_description": "Amnesty International USA (AIUSA) is the U.S. Section of Amnesty International. Founded in London in 1961, Amnesty International (AI) is a Nobel Prize-winning grassroots activist organization with over 8 million members and supporters worldwide. Amnesty International's vision is of a world in which every person enjoys all of the human rights enshrined in the Universal Declaration of Human Rights and other international human rights standards. We are people from across the world standing up for humanity and human rights. Our purpose is to protect people wherever justice, freedom, truth and dignity are denied. We investigate and expose abuses, educate and mobilize the public, and help transform societies to create a safer, more just world.",
        "charity_short_description": "Action for human rights. Hope for humanity.",
        "rating": "87.73",
        "clean_charity_link": "amnestyusa.org"
    },
    {
        "charity_name": "Minority Corporate Counsel Association",
        "charity_link": "http://mcca.com/",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=14755&fromlistid=266",
        "charity_description": "The Minority Corporate Counsel Association (MCCA) was founded in 1997 to advocate for the expanded hiring, retention, and promotion of minority attorneys in corporate law departments and the law firms that serve them. MCCA furthers its mission through the collection and dissemination of information about diversity in the legal profession. MCCA takes an inclusive approach to the definition of \"diversity.\" Therefore, its research addresses issues of race/ethnicity, gender, sexual orientation, disability status, and generational differences which impact the legal profession's workforce.",
        "charity_short_description": "Advancing Diversity, Inclusion and Equity",
        "rating": "94.35",
        "clean_charity_link": "mcca.com"
    },
    {
        "charity_name": "Public Justice Center",
        "charity_link": "http://publicjustice.org/",
        "donate_link": "https://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=14588&fromlistid=266",
        "charity_description": "The Public Justice Center pursues systemic change to build a just society.The PJC uses legal advocacy tools to pursue social justice, economic and race equity, and fundamental human rights for people who are struggling to provide for their basic needs.The PJC is a civil legal aid office that provides advice and representation to low-income clients, advocates before legislatures and government agencies, and collaborates with community and advocacy organizations.The PJC chooses projects and cases that will make a significant impact on systems, laws, and policies.",
        "charity_short_description": "We are building a just society",
        "rating": "94.14",
        "clean_charity_link": "publicjustice.org"
    }
]